# SYD DAT 8 Lab 1 - Git and Markdown

## Homework:

#### Setup
* Resolve any installation issues before next class.
* Make sure you have a github profile and created a repo called "SYD_DAT_8"
* Clone the class repo (this one!)
* Review this [code](../labs/Week 1/00_python_refresher.py) for a recap of some Python basics.

#### Communication
* Read [Analyzing the Analyzers](http://cdn.oreillystatic.com/oreilly/radarreport/0636920029014/Analyzing_the_Analyzers.pdf) for a useful look at the different types of data scientists. Write down 5 key points you took away from the article
* Read about some [Markdown Techniques](http://daringfireball.net/projects/markdown/syntax)
* Write a summary of 2 chapters of [The Data Science Handbook](http://www.thedatasciencehandbook.com/) in Markdown in this notebook and commit it to your repository on github

#### Programming
* Complete the lab from class and the additional Exercise below

#### Course Project
* Come up with 5 different ideas for your course project. For each one list:
  * Overview of your idea
  * What data you will use
  * What the outcome is that you are trying to achieve
  * Any ideas of modelling techniques it may involve
  
  Course Project 1 - Financial Modelling Backtesting Tool
  Overview - Create a model which evaluates (already made) financial models. This tool will also provide data visulaisation of the evaluation and model outcomes.
  Data - underlying data will be financial time series data, which I already have/have access to.
  Outcome - I want to achieve a model which can provide insightful and visual backtesting information about a financial model it's evaluating.
  Modelling tecniques - evaluation of underlying relationship, logistic regression of trade signalling. 
  
  Course Project 2 - Economic model for USTs
  Overview - Look at large changes in UST yield (>50pts within 6months), and assess if key leading eco variables drove these)
  Data - UST (changes in yield), 3-5 key economic variables (change)
  Outcome - to gain some predictive power on large changes in yield.
  Modelling techniques - multiple linear regression of change in leading eco variables to change in UST yield. Evaluate relatiosnhip
  

**Instructions: copy this file and append your name in the filename, e.g. Homework1_ian_hansel.ipynb.
Then commit this in your local repository, push it to your github account so I can see your work. Remeber if you get stuck to look at the slides going over Git**

In [ ]:
##Analyzing the Analyzers
#1-Data science is a very broad term and is often not well understood.
#2-The growing demand for skillsets within data science has created buzzwords and confusion
#3-The research in the article breaks down data science skillsets into categories: data businesspeople, data creatives,
#data developers, data researchers
#4-T-Shaped analysis looks at the breadth and depth of skillsets across a discipline. This becomes an important measure
#in data science as it's almost impossibls to have depth across all of the breadth.
#5-CEO's and C-suite are on a journey to best define this area of business, and the people within it. The article puts a 
#helpful framework together to assist in this.

## Exercise Four - Movie Lens Data

In [ ]:
# for each occupation in 'users', count the number of occurrences

# for each occupation, calculate the mean age

# for each occupation, calculate the minimum and maximum ages

# for each combination of occupation and gender, calculate the mean age

# randomly sample a DataFrame

# detect duplicate users

In [7]:
import pandas as pd
pd.read_table('u.user',header=None)
columns='emp ID','age','gender','job','pcode'
users = pd.read_table('u.user', sep='|', header=None, names=columns, index_col='emp ID', dtype={'pcode':str})
users.head()

        age gender         job  pcode
emp ID
1        24      M  technician  85711
2        53      F       other  94043
3        23      M      writer  32067
4        24      M  technician  43537
5        33      F       other  15213

In [9]:
# for each occupation, calculate the mean age
users.groupby('job').mean()

                     age
job
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

In [21]:
# for each occupation, calculate the minimum and maximum ages
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [26]:
# for each combination of occupation and gender, calculate the mean age
users.groupby(['job','gender']).mean()

                            age
job           gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000
              M       36.600000
entertainment F       31.000000
              M       29.000000
executive     F       44.000000
              M       38.172414
healthcare    F       39.818182
              M       45.400000
homemaker     F       34.166667
              M       23.000000
lawyer        F       39.500000
              M       36.200000
librarian     F       40.000000
              M       40.000000
marketing     F       37.200000
              M       37.875000
none          F       36.500000
              M       18.600000
other         F       35.472222
              M       34.028986
programmer    F       32.166667
              M       33.216667
retired       F       70.000000
              M       62.538462
salesman      F       27.000000
              M       38.555556
scientist     F       28.333333
              M       36.321429
student       F       20.750000
              M       22.669118
technician    F       38.000000
              M       32.961538
writer        F       37.631579
              M       35.346154

In [36]:
# randomly sample a DataFrame
users.sample(10)

        age gender         job  pcode
emp ID
542      21      M     student  60515
631      18      F     student  38866
270      18      F     student  63119
401      46      F  healthcare  84107
311      32      M  technician  73071
134      31      M  programmer  80236
683      42      M   librarian  23509
31       24      M      artist  10003
76       20      M     student  02215
877      30      M       other  77504

In [37]:
users.isnull().sum()       # count the missing values in each column

age       0
gender    0
job       0
pcode     0
dtype: int64

In [62]:
# detect duplicate users
users.index.get_duplicates()

[]